app/controllers/users_controller.rb

   def create
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("username", "email", "salt", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"